app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "author", "blog_entry", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "New_post"], ["author", "Jaden"], ["blog_entry", "Hello world!"], ["created_at", "2018-11-12 14:27:02.660763"], ["updated_at", "2018-11-12 14:27:02.660763"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "author" = ?, "blog_entry" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", ""], ["author", ""], ["blog_entry", ""], ["updated_at", "2018-11-09 15:27:40.185677"], ["id", 6]]